data = [1, 2, 3, 5, 8, True,"Hello world", 6.7, [10, 20]]

data[0] = 50
data[6] = "Have a good day"

print(data)
print([6])

print(data[-1][1])
#Якщо ти хочеш дістати елемент з списку в якому знаходиться  ще один список треба в перших дужках
#викликати через '-' другі дужки і в других дужках вже потрібний нам елемент


numbers = [5, 2, 7]
numbers.append(55)#додає новий елемент в кінець списку
numbers.insert(1, True) #додає новий елемент в будь-яке місце списку
numbers.extend([3, 6, 5]) #дозволяє додати наявні елементи в список ще раз
numbers.sort() #сортує числа в списку
numbers.reverse() #перекручує сортування чисел
numbers.pop() #видаляє останній елемент, в дужках можна вибрати під яким індексом буде видалено елемент
numbers.remove(True)#видаляє написаний в дужках елемент


print(numbers)